{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "a2de64e6-ee4e-4274-b8e3-e5c903aa36f5",
   "metadata": {},
   "outputs": [
    {
     "ename": "ModuleNotFoundError",
     "evalue": "No module named 'torch_geometric'",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mModuleNotFoundError\u001b[0m                       Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[27], line 7\u001b[0m\n\u001b[0;32m      5\u001b[0m \u001b[38;5;28;01mimport\u001b[39;00m \u001b[38;5;21;01mjson\u001b[39;00m\n\u001b[0;32m      6\u001b[0m \u001b[38;5;28;01mimport\u001b[39;00m \u001b[38;5;21;01mtorch\u001b[39;00m\n\u001b[1;32m----> 7\u001b[0m \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;21;01mtorch_geometric\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01mdata\u001b[39;00m \u001b[38;5;28;01mimport\u001b[39;00m Data\n",
      "\u001b[1;31mModuleNotFoundError\u001b[0m: No module named 'torch_geometric'"
     ]
    }
   ],
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "import pandas as pd\n",
    "import google.generativeai as genai\n",
    "import numpy as np\n",
    "import json\n",
    "import torch\n",
    "from torch_geometric.data import Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "04d28cdb-ab12-4dc7-803a-c41a75ea998e",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   Index                                              Title  \\\n",
      "0      0  1 BHK Ready to Occupy Flat for sale in Srushti...   \n",
      "1      1  2 BHK Ready to Occupy Flat for sale in Dosti V...   \n",
      "2      2  2 BHK Ready to Occupy Flat for sale in Sunrise...   \n",
      "3      4  2 BHK Ready to Occupy Flat for sale in TenX Ha...   \n",
      "4      5  1 BHK Ready to Occupy Flat for sale in Virat A...   \n",
      "\n",
      "                                         Description  Amount(in rupees)  \\\n",
      "0  Bhiwandi, Thane has an attractive 1 BHK Flat f...          4200000.0   \n",
      "1  One can find this stunning 2 BHK flat for sale...          9800000.0   \n",
      "2  Up for immediate sale is a 2 BHK apartment in ...         14000000.0   \n",
      "3  This lovely 2 BHK Flat in Pokhran Road, Thane ...         16000000.0   \n",
      "4  Creatively planned and constructed is a 1 BHK ...          4500000.0   \n",
      "\n",
      "   Price (in rupees) location         Status Transaction      Furnishing  \\\n",
      "0             6000.0    thane  Ready to Move      Resale     Unfurnished   \n",
      "1            13799.0    thane  Ready to Move      Resale  Semi-Furnished   \n",
      "2            17500.0    thane  Ready to Move      Resale     Unfurnished   \n",
      "3            18824.0    thane  Ready to Move      Resale     Unfurnished   \n",
      "4             6618.0    thane  Ready to Move      Resale     Unfurnished   \n",
      "\n",
      "    facing Bathroom Balcony Car Parking             Ownership  Current Floor  \\\n",
      "0  Unknown        1       2           0               Unknown             10   \n",
      "1     East        2       0      1 Open              Freehold              3   \n",
      "2     East        2       0   1 Covered              Freehold             10   \n",
      "3     West        2       0   1 Covered  Co-operative Society             20   \n",
      "4     East        1       1           0  Co-operative Society              2   \n",
      "\n",
      "   Total Floors  \n",
      "0            11  \n",
      "1            22  \n",
      "2            29  \n",
      "3            42  \n",
      "4             7  \n"
     ]
    }
   ],
   "source": [
    "df = pd.read_csv(\"data/cleaned_house_prices_data.csv\", nrows=5000)\n",
    "print(df.head())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "d392f353-5c0d-41f6-b98c-3b4cb3a0ec2b",
   "metadata": {},
   "outputs": [],
   "source": [
    "df['amount'] = df['Amount(in rupees)']\n",
    "df['price'] = df['Price (in rupees)']\n",
    "df = df.drop(columns=[\"Index\", 'Amount(in rupees)', 'Price (in rupees)'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "d4d2bad6-a2bb-426c-b33a-6094fe76384a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Title\n",
      "Description\n",
      "location\n",
      "Status\n",
      "Transaction\n",
      "Furnishing\n",
      "facing\n",
      "Bathroom\n",
      "Balcony\n",
      "Car Parking\n",
      "Ownership\n",
      "Current Floor\n",
      "Total Floors\n",
      "amount\n",
      "price\n"
     ]
    }
   ],
   "source": [
    "for col in df.columns:\n",
    "    print(col)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "bed626d7-90b3-4b64-868e-1d98408bb0d1",
   "metadata": {},
   "outputs": [],
   "source": [
    "df.columns = (\n",
    "    df.columns.str.lower() # Chuyển về chữ thường\n",
    "    .str.replace(\" \", \"_\") # Thay khoảng trắng bằng dấu gạch dưới (_)\n",
    "    .str.replace(r\"\\(.*\\)\", \"\", regex=True) # Xóa nội dung trong ngoặc\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "16ed527f-1aaf-4ef7-8f3c-f02a27462f66",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\Admin\\AppData\\Local\\Temp\\ipykernel_14688\\3045156017.py:6: LangChainDeprecationWarning: The class `Neo4jGraph` was deprecated in LangChain 0.3.8 and will be removed in 1.0. An updated version of the class exists in the :class:`~langchain-neo4j package and should be used instead. To use it run `pip install -U :class:`~langchain-neo4j` and import as `from :class:`~langchain_neo4j import Neo4jGraph``.\n",
      "  graph = Neo4jGraph(\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "okay\n"
     ]
    }
   ],
   "source": [
    "NEO4J_URL = \"bolt://localhost:7687\"\n",
    "NEO4J_USERNAME = \"neo4j\"\n",
    "NEO4J_PASSWORD = \"hqiineo4j\"\n",
    "NEO4J_DATABASE = \"neo4j\"\n",
    "\n",
    "graph = Neo4jGraph(\n",
    "    url=NEO4J_URL,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    database=NEO4J_DATABASE\n",
    ")\n",
    "\n",
    "print(\"okay\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "ee543bc6-1e95-45b8-ad86-6c813fd569b3",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✅ Dữ liệu đã nhập vào Neo4j!\n"
     ]
    }
   ],
   "source": [
    "\n",
    "def insert_data(title, description, amount, price, location, status, transaction, furnishing, facing, bathroom, balcony, car_parking, ownership, current_floor, total_floors):\n",
    "    query = \"\"\"\n",
    "    MERGE (h:House {title: $title})\n",
    "    SET h.description = $description,\n",
    "        h.amount = $amount,\n",
    "        h.price = $price\n",
    "    \n",
    "    MERGE (l:Location {name: $location})\n",
    "    MERGE (h)-[:LOCATED_IN]->(l)\n",
    "    \n",
    "    MERGE (o:Ownership {name: $ownership})\n",
    "    MERGE (h)-[:HAS_OWNERSHIP]->(o)\n",
    "    \n",
    "    MERGE (s:Status {name: $status})\n",
    "    MERGE (h)-[:HAS_STATUS]->(s)\n",
    "    \n",
    "    MERGE (t:Transaction {name: $transaction})\n",
    "    MERGE (h)-[:HAS_TRANSACTION]->(t)\n",
    "    \n",
    "    MERGE (f:Furnishing {name: $furnishing})\n",
    "    MERGE (h)-[:HAS_FURNISHING]->(f)\n",
    "    \n",
    "    MERGE (fc:Facing {name: $facing})\n",
    "    MERGE (h)-[:HAS_FACING]->(fc)\n",
    "    \n",
    "    MERGE (b:Bathroom {name: $bathroom})\n",
    "    MERGE (h)-[:HAS_BATHROOM]->(b)\n",
    "    \n",
    "    MERGE (ba:Balcony {name: $balcony})\n",
    "    MERGE (h)-[:HAS_BALCONY]->(ba)\n",
    "    \n",
    "    MERGE (cp:CarParking {name: $car_parking})\n",
    "    MERGE (h)-[:HAS_CAR_PARKING]->(cp)\n",
    "    \n",
    "    MERGE (cf:CurrentFloor {name: $current_floor})\n",
    "    MERGE (h)-[:HAS_CURRENT_FLOOR]->(cf)\n",
    "    \n",
    "    MERGE (tf:TotalFloors {name: $total_floors})\n",
    "    MERGE (h)-[:HAS_TOTAL_FLOORS]->(tf)\n",
    "    \"\"\"\n",
    "\n",
    "    graph.query(query, params={\n",
    "        \"title\": title, \n",
    "        \"description\": description, \n",
    "        \"amount\": amount, \n",
    "        \"price\": price, \n",
    "        \"location\": location, \n",
    "        \"status\": status, \n",
    "        \"transaction\": transaction, \n",
    "        \"furnishing\": furnishing, \n",
    "        \"facing\": facing, \n",
    "        \"bathroom\": bathroom, \n",
    "        \"balcony\": balcony, \n",
    "        \"car_parking\": car_parking, \n",
    "        \"ownership\": ownership, \n",
    "        \"current_floor\": current_floor, \n",
    "        \"total_floors\": total_floors\n",
    "    })\n",
    "\n",
    "print(\"✅ Dữ liệu đã nhập vào Neo4j!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "8d81bccc-def3-4d1d-870a-1f7f19a77363",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Cấu hình Gemini API\n",
    "genai.configure(api_key=\"AIzaSyAmLesw2keGhIrZPMEyYJUs1PUqIidIWFU\")\n",
    "\n",
    "# Khởi tạo model Gemini\n",
    "model = genai.GenerativeModel(\"gemini-2.0-flash\")\n",
    "\n",
    "# # Hàm trích xuất thực thể từ câu hỏi\n",
    "# def extract_entities(question):\n",
    "#     prompt = f\"Trích xuất các thực thể quan trọng từ câu hỏi: '{question}'. Chỉ trả về danh sách thực thể, không thêm bất kỳ văn bản nào khác. Ưu tiên tính liên kết và thông nhất của thực thể\"\n",
    "#     response = model.generate_content(prompt)\n",
    "    \n",
    "#     if response and response.text:\n",
    "#         return response.text.strip().split(\", \")\n",
    "#     else:\n",
    "#         return []\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d00378af-b66b-4163-b465-2cb46f57bb48",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_all_entities(tx):\n",
    "    query = \"\"\"\n",
    "    MATCH (n) RETURN DISTINCT n.name AS entity\n",
    "    \"\"\"\n",
    "    result = tx.run(query)\n",
    "    return [record[\"entity\"] for record in result if record[\"entity\"]]\n",
    "\n",
    "with driver.session() as session:\n",
    "    entity_list = session.read_transaction(get_all_entities)\n",
    "\n",
    "print(f\"✅ Lấy {len(entity_list)} thực thể từ Knowledge Graph\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "218a925c-3ea8-43b8-9e09-8666d93a700b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# user_input = \"i want to buy a 2 BHK Ready to Occupy Flat that located in thane and have 2 bathrooms\"\n",
    "# extract_entities(user_input)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "1756fbe8-cb9e-489b-8f53-c6dfc537ebf0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# !pip install rapidfuzz"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "5d32a328-29d8-42e3-90d9-d3ab4ac896e6",
   "metadata": {},
   "outputs": [],
   "source": [
    "# from rapidfuzz import process, fuzz\n",
    "\n",
    "# def find_top_matches(extracted_entities, entity_dict, top_n=5, threshold=10):\n",
    "#     \"\"\"\n",
    "#     Tìm top_n thực thể gần nhất cho từng thực thể trích xuất.\n",
    "#     Trả về danh sách các thực thể tương đồng với % độ giống nhau.\n",
    "#     \"\"\"\n",
    "#     results = {}  # Lưu kết quả theo từng thực thể trích xuất\n",
    "\n",
    "#     entity_names = [str(name) for name in entity_dict.keys()]  # Lấy danh sách tên thực thể\n",
    "\n",
    "#     for entity in extracted_entities:\n",
    "#         entity = str(entity)  # Đảm bảo entity là chuỗi\n",
    "\n",
    "#         matches = process.extract(entity, entity_names, scorer=fuzz.token_sort_ratio, limit=top_n)\n",
    "\n",
    "#         # Lọc các thực thể có độ tương đồng >= threshold\n",
    "#         filtered_matches = [(match, score, entity_dict[match]) for match, score, _ in matches if score >= threshold]\n",
    "\n",
    "#         if filtered_matches:\n",
    "#             results[entity] = filtered_matches  # Lưu danh sách thực thể gần nhất\n",
    "\n",
    "#     return results\n",
    "\n",
    "# find_best_matches(extract_entities(user_input), entity_dict=entity_dict)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "e80a3e68-66f8-4c4d-9f42-70421441f40d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# user_input = \"2 BHK Ready to Occupy Flat, thane, 2 bathrooms\"\n",
    "\n",
    "# # 1️⃣ Trích xuất thực thể từ LLM\n",
    "# extracted_entities = extract_entities(user_input)  # Trích xuất thực thể\n",
    "\n",
    "# # 2️⃣ Tìm kiếm 5 thực thể gần nhất cho từng thực thể\n",
    "# top_matches = find_top_matches(extracted_entities, entity_dict, top_n=5, threshold=10)\n",
    "\n",
    "# # 3️⃣ Hiển thị kết quả\n",
    "# for entity, matches in top_matches.items():\n",
    "#     print(f\"📌 **Thực thể trích xuất**: {entity}\")\n",
    "#     for match, score, entity_type in matches:\n",
    "#         print(f\"   🔹 {match} ({entity_type}) - {score}% giống nhau\")\n",
    "#     print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "22ad95d2-0ec5-42b3-a05b-3863d0775c77",
   "metadata": {},
   "outputs": [],
   "source": [
    "# import json\n",
    "\n",
    "# # Đọc schema từ file JSON\n",
    "# with open(\"data/schema.json\", \"r\", encoding=\"utf-8\") as f:\n",
    "#     schema = json.load(f)\n",
    "\n",
    "# def generate_cypher_prompt(text):\n",
    "#     CYPHER_GENERATION_TEMPLATE = f\"\"\"Nhiệm vụ: Tạo một truy vấn Cypher để truy vấn cơ sở dữ liệu đồ thị Neo4j.\n",
    "#         Hướng dẫn:\n",
    "#         - Phân tích câu hỏi và trích xuất các thành phần đồ thị liên quan một cách linh hoạt. Sử dụng thông tin này để xây dựng truy vấn Cypher.\n",
    "#         - Chỉ sử dụng các loại quan hệ và thuộc tính từ sơ đồ đã cung cấp. Không bao gồm bất kỳ loại quan hệ hoặc thuộc tính nào khác.\n",
    "#         - Sơ đồ được xây dựng dựa trên cấu trúc đồ thị với các nút và quan hệ như sau:\n",
    "#         {json.dumps(schema, indent=4, ensure_ascii=False)}\n",
    "#         - Chỉ trả về truy vấn Cypher đã được tạo trong phản hồi của bạn. Không bao gồm giải thích, chú thích hoặc bất kỳ văn bản bổ sung nào khác. \n",
    "#         - Đảm bảo truy vấn Cypher phản hồi chính xác câu hỏi được đưa ra theo đúng sơ đồ.\n",
    "\n",
    "#         câu cần bạn sinh truy vấn là:\n",
    "#         {text}\n",
    "#     \"\"\"\n",
    "\n",
    "#     response = model.generate_content(CYPHER_GENERATION_TEMPLATE)\n",
    "#     return response.text \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "4815e5f4-5fab-4f69-9f64-b2c6b434c430",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "```cypher\n",
      "MATCH (h:House)-[:HAS_BATHROOM]->(b:Bathroom {`Bathroom`: \"2\"})\n",
      "MATCH (h)-[:HAS_STATUS]->(s:Status {`Status`: \"Ready to Move\"})\n",
      "MATCH (h)-[:HAS_FACING]->(f:Facing {`Facing`: \"West\"})\n",
      "MATCH (h)-[:LOCATED_IN]->(l:Location)\n",
      "WHERE l.Location = \"thane\"\n",
      "RETURN h\n",
      "```\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'MATCH (h:House)-[:HAS_BATHROOM]->(b:Bathroom {`Bathroom`: \"2\"})\\nMATCH (h)-[:HAS_STATUS]->(s:Status {`Status`: \"Ready to Move\"})\\nMATCH (h)-[:HAS_FACING]->(f:Facing {`Facing`: \"West\"})\\nMATCH (h)-[:LOCATED_IN]->(l:Location)\\nWHERE l.Location = \"thane\"\\nRETURN h'"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# client_message = \"i want to buy a 1 BHK Ready to Occupy Flat for sale in Srushti that have 2 bathrooms and face to the west\"\n",
    "# cypher_result = generate_cypher_prompt(client_message)\n",
    "# print(cypher_result)\n",
    "# def clean_cypher_code(code: str) -> str:\n",
    "#     return code.replace(\"```cypher\", \"\").replace(\"```\", \"\").strip()\n",
    "\n",
    "# cypher_result = clean_cypher_code(cypher_result)\n",
    "# cypher_result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "78bcdc1b-d996-4366-b514-2b5fc9dfa093",
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'graph' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[25], line 1\u001b[0m\n\u001b[1;32m----> 1\u001b[0m result \u001b[38;5;241m=\u001b[39m \u001b[43mgraph\u001b[49m\u001b[38;5;241m.\u001b[39mquery(cypher_result)\n\u001b[0;32m      2\u001b[0m result\n",
      "\u001b[1;31mNameError\u001b[0m: name 'graph' is not defined"
     ]
    }
   ],
   "source": [
    "# result = graph.query(cypher_result)\n",
    "# result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "id": "80ad584f-dd47-47c3-a7b2-0d3f54e06008",
   "metadata": {},
   "outputs": [],
   "source": [
    "def house_predict_prompt(row):\n",
    "    prompt_template = f\"\"\"Dưới đây là thông tin về một căn nhà, hãy ước tính giá bán dựa trên dữ liệu thị trường hiện tại theo đơn vị INR.  \n",
    "    Chỉ trả về một con số duy nhất là giá nhà (không giải thích, không kèm theo ký tự khác).  \n",
    "\n",
    "    Thông tin căn nhà:  \n",
    "    - **Vị trí:** {row['location']}  \n",
    "    - **Trạng thái:** {row['status']}  \n",
    "    - **Loại giao dịch:** {row['transaction']}  \n",
    "    - **Nội thất:** {row['furnishing']}  \n",
    "    - **Hướng nhà:** {row['facing']}  \n",
    "    - **Số phòng tắm:** {row['bathroom']}  \n",
    "    - **Số ban công:** {row['balcony']}  \n",
    "    - **Chỗ để xe:** {row['car_parking']}  \n",
    "    - **Quyền sở hữu:** {row['ownership']}  \n",
    "    - **Tầng hiện tại:** {row['current_floor']}  \n",
    "    - **Tổng số tầng:** {row['total_floors']}  \n",
    "\n",
    "    Dưới đây là thông tin ví dụ về một số căn nhà và giá của chúng:\\n\\n\n",
    "    \"\"\"\n",
    "\n",
    "    # Chọn ví dụ từ dataset làm dữ liệu Few-shot learning\n",
    "    examples = df.sample(40).to_dict(orient=\"records\")\n",
    "\n",
    "    for ex in examples:\n",
    "        prompt_template += f\"- **Vị trí:** {ex['location']}, **Trạng thái:** {ex['status']}, **Loại giao dịch:** {ex['transaction']}, **Nội thất:** {ex['furnishing']}, **Hướng:** {ex['facing']}, **Phòng tắm:** {ex['bathroom']}, **Ban công:** {ex['balcony']}, **Chỗ để xe:** {ex['car_parking']}, **Quyền sở hữu:** {ex['ownership']}, **Tầng hiện tại:** {ex['current_floor']}, **Tổng tầng:** {ex['total_floors']}, **Giá nhà:** {ex['amount']} \\n\\n\"\n",
    "    \n",
    "\n",
    "    prompt_template += \"Vui lòng dự đoán giá nhà và chỉ trả về một con số duy nhất, không kèm theo văn bản hoặc ký tự nào khác.\"\n",
    "\n",
    "    response = model.generate_content(prompt_template)\n",
    "    return response.text "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "4b836746-32c2-43b6-b4d4-aec286d809de",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>description</th>\n",
       "      <th>location</th>\n",
       "      <th>status</th>\n",
       "      <th>transaction</th>\n",
       "      <th>furnishing</th>\n",
       "      <th>facing</th>\n",
       "      <th>bathroom</th>\n",
       "      <th>balcony</th>\n",
       "      <th>car_parking</th>\n",
       "      <th>ownership</th>\n",
       "      <th>current_floor</th>\n",
       "      <th>total_floors</th>\n",
       "      <th>amount</th>\n",
       "      <th>price</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1 BHK Ready to Occupy Flat for sale in Srushti...</td>\n",
       "      <td>Bhiwandi, Thane has an attractive 1 BHK Flat f...</td>\n",
       "      <td>thane</td>\n",
       "      <td>Ready to Move</td>\n",
       "      <td>Resale</td>\n",
       "      <td>Unfurnished</td>\n",
       "      <td>Unknown</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>Unknown</td>\n",
       "      <td>10</td>\n",
       "      <td>11</td>\n",
       "      <td>4200000.0</td>\n",
       "      <td>6000.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2 BHK Ready to Occupy Flat for sale in Dosti V...</td>\n",
       "      <td>One can find this stunning 2 BHK flat for sale...</td>\n",
       "      <td>thane</td>\n",
       "      <td>Ready to Move</td>\n",
       "      <td>Resale</td>\n",
       "      <td>Semi-Furnished</td>\n",
       "      <td>East</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>1 Open</td>\n",
       "      <td>Freehold</td>\n",
       "      <td>3</td>\n",
       "      <td>22</td>\n",
       "      <td>9800000.0</td>\n",
       "      <td>13799.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2 BHK Ready to Occupy Flat for sale in Sunrise...</td>\n",
       "      <td>Up for immediate sale is a 2 BHK apartment in ...</td>\n",
       "      <td>thane</td>\n",
       "      <td>Ready to Move</td>\n",
       "      <td>Resale</td>\n",
       "      <td>Unfurnished</td>\n",
       "      <td>East</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>1 Covered</td>\n",
       "      <td>Freehold</td>\n",
       "      <td>10</td>\n",
       "      <td>29</td>\n",
       "      <td>14000000.0</td>\n",
       "      <td>17500.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2 BHK Ready to Occupy Flat for sale in TenX Ha...</td>\n",
       "      <td>This lovely 2 BHK Flat in Pokhran Road, Thane ...</td>\n",
       "      <td>thane</td>\n",
       "      <td>Ready to Move</td>\n",
       "      <td>Resale</td>\n",
       "      <td>Unfurnished</td>\n",
       "      <td>West</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>1 Covered</td>\n",
       "      <td>Co-operative Society</td>\n",
       "      <td>20</td>\n",
       "      <td>42</td>\n",
       "      <td>16000000.0</td>\n",
       "      <td>18824.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1 BHK Ready to Occupy Flat for sale in Virat A...</td>\n",
       "      <td>Creatively planned and constructed is a 1 BHK ...</td>\n",
       "      <td>thane</td>\n",
       "      <td>Ready to Move</td>\n",
       "      <td>Resale</td>\n",
       "      <td>Unfurnished</td>\n",
       "      <td>East</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>Co-operative Society</td>\n",
       "      <td>2</td>\n",
       "      <td>7</td>\n",
       "      <td>4500000.0</td>\n",
       "      <td>6618.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>195</th>\n",
       "      <td>2 BHK Ready to Occupy Flat for sale in Hiranan...</td>\n",
       "      <td>Carefully laid out in the prime location of Hi...</td>\n",
       "      <td>thane</td>\n",
       "      <td>Ready to Move</td>\n",
       "      <td>Resale</td>\n",
       "      <td>Semi-Furnished</td>\n",
       "      <td>North - East</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>1 Open</td>\n",
       "      <td>Freehold</td>\n",
       "      <td>5</td>\n",
       "      <td>14</td>\n",
       "      <td>16500000.0</td>\n",
       "      <td>16517.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>196</th>\n",
       "      <td>2 BHK Ready to Occupy Flat for sale in Samrin ...</td>\n",
       "      <td>This exquisite 2 BHK Flat is offered for sale ...</td>\n",
       "      <td>thane</td>\n",
       "      <td>Ready to Move</td>\n",
       "      <td>New Property</td>\n",
       "      <td>Unfurnished</td>\n",
       "      <td>North - East</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>1 Covered</td>\n",
       "      <td>Freehold</td>\n",
       "      <td>2</td>\n",
       "      <td>29</td>\n",
       "      <td>15900000.0</td>\n",
       "      <td>22053.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>197</th>\n",
       "      <td>2 BHK Ready to Occupy Flat for sale in And For...</td>\n",
       "      <td>One can find this stunning 2 BHK flat for sale...</td>\n",
       "      <td>thane</td>\n",
       "      <td>Ready to Move</td>\n",
       "      <td>Resale</td>\n",
       "      <td>Semi-Furnished</td>\n",
       "      <td>East</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>Freehold</td>\n",
       "      <td>7</td>\n",
       "      <td>19</td>\n",
       "      <td>6300000.0</td>\n",
       "      <td>7545.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>198</th>\n",
       "      <td>2 BHK Ready to Occupy Flat for sale Bhaskar Co...</td>\n",
       "      <td>This ready to move-in 2 BHK flat is available ...</td>\n",
       "      <td>thane</td>\n",
       "      <td>Ready to Move</td>\n",
       "      <td>New Property</td>\n",
       "      <td>Unfurnished</td>\n",
       "      <td>East</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>1 Covered</td>\n",
       "      <td>Freehold</td>\n",
       "      <td>4</td>\n",
       "      <td>30</td>\n",
       "      <td>19300000.0</td>\n",
       "      <td>14846.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>199</th>\n",
       "      <td>3 BHK Ready to Occupy Flat for sale in Project...</td>\n",
       "      <td>This beautiful 3 BHK Flat is available for sal...</td>\n",
       "      <td>thane</td>\n",
       "      <td>Ready to Move</td>\n",
       "      <td>Resale</td>\n",
       "      <td>Semi-Furnished</td>\n",
       "      <td>West</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>1 Covered,</td>\n",
       "      <td>Freehold</td>\n",
       "      <td>12</td>\n",
       "      <td>27</td>\n",
       "      <td>29900000.0</td>\n",
       "      <td>19933.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>200 rows × 15 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 title  \\\n",
       "0    1 BHK Ready to Occupy Flat for sale in Srushti...   \n",
       "1    2 BHK Ready to Occupy Flat for sale in Dosti V...   \n",
       "2    2 BHK Ready to Occupy Flat for sale in Sunrise...   \n",
       "3    2 BHK Ready to Occupy Flat for sale in TenX Ha...   \n",
       "4    1 BHK Ready to Occupy Flat for sale in Virat A...   \n",
       "..                                                 ...   \n",
       "195  2 BHK Ready to Occupy Flat for sale in Hiranan...   \n",
       "196  2 BHK Ready to Occupy Flat for sale in Samrin ...   \n",
       "197  2 BHK Ready to Occupy Flat for sale in And For...   \n",
       "198  2 BHK Ready to Occupy Flat for sale Bhaskar Co...   \n",
       "199  3 BHK Ready to Occupy Flat for sale in Project...   \n",
       "\n",
       "                                           description location  \\\n",
       "0    Bhiwandi, Thane has an attractive 1 BHK Flat f...    thane   \n",
       "1    One can find this stunning 2 BHK flat for sale...    thane   \n",
       "2    Up for immediate sale is a 2 BHK apartment in ...    thane   \n",
       "3    This lovely 2 BHK Flat in Pokhran Road, Thane ...    thane   \n",
       "4    Creatively planned and constructed is a 1 BHK ...    thane   \n",
       "..                                                 ...      ...   \n",
       "195  Carefully laid out in the prime location of Hi...    thane   \n",
       "196  This exquisite 2 BHK Flat is offered for sale ...    thane   \n",
       "197  One can find this stunning 2 BHK flat for sale...    thane   \n",
       "198  This ready to move-in 2 BHK flat is available ...    thane   \n",
       "199  This beautiful 3 BHK Flat is available for sal...    thane   \n",
       "\n",
       "            status   transaction      furnishing        facing bathroom  \\\n",
       "0    Ready to Move        Resale     Unfurnished       Unknown        1   \n",
       "1    Ready to Move        Resale  Semi-Furnished          East        2   \n",
       "2    Ready to Move        Resale     Unfurnished          East        2   \n",
       "3    Ready to Move        Resale     Unfurnished          West        2   \n",
       "4    Ready to Move        Resale     Unfurnished          East        1   \n",
       "..             ...           ...             ...           ...      ...   \n",
       "195  Ready to Move        Resale  Semi-Furnished  North - East        2   \n",
       "196  Ready to Move  New Property     Unfurnished  North - East        2   \n",
       "197  Ready to Move        Resale  Semi-Furnished          East        2   \n",
       "198  Ready to Move  New Property     Unfurnished          East        2   \n",
       "199  Ready to Move        Resale  Semi-Furnished          West        3   \n",
       "\n",
       "    balcony car_parking             ownership  current_floor  total_floors  \\\n",
       "0         2           0               Unknown             10            11   \n",
       "1         0      1 Open              Freehold              3            22   \n",
       "2         0   1 Covered              Freehold             10            29   \n",
       "3         0   1 Covered  Co-operative Society             20            42   \n",
       "4         1           0  Co-operative Society              2             7   \n",
       "..      ...         ...                   ...            ...           ...   \n",
       "195       0      1 Open              Freehold              5            14   \n",
       "196       1   1 Covered              Freehold              2            29   \n",
       "197       3           0              Freehold              7            19   \n",
       "198       2   1 Covered              Freehold              4            30   \n",
       "199       0  1 Covered,              Freehold             12            27   \n",
       "\n",
       "         amount    price  \n",
       "0     4200000.0   6000.0  \n",
       "1     9800000.0  13799.0  \n",
       "2    14000000.0  17500.0  \n",
       "3    16000000.0  18824.0  \n",
       "4     4500000.0   6618.0  \n",
       "..          ...      ...  \n",
       "195  16500000.0  16517.0  \n",
       "196  15900000.0  22053.0  \n",
       "197   6300000.0   7545.0  \n",
       "198  19300000.0  14846.0  \n",
       "199  29900000.0  19933.0  \n",
       "\n",
       "[200 rows x 15 columns]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "fe54c72c-16f3-45a1-8eac-9c7945b7264b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Giá nhà thực tế: 10000000.0\n",
      "Giá nhà dự đoán: 6500000\n",
      "\n"
     ]
    }
   ],
   "source": [
    "row = df.iloc[50]\n",
    "print(f\"Giá nhà thực tế: {row['amount']}\")\n",
    "predicted_price = house_predict_prompt(row)\n",
    "print(f\"Giá nhà dự đoán: {predicted_price}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "62b5c8d1-7d3b-4b41-bb4f-d0dbcaff9568",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "cuda-gpt",
   "language": "python",
   "name": "cuda"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
